<?xml version="1.0"?>
<net name="tf2onnx" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,10,1" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="const_fold_opt__209" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="const_fold_opt__209">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="functional_1/conv1d_1/convolution/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_1/convolution/ExpandDims:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="new_shape__179" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="new_shape__179">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="functional_1/conv1d_1/convolution__15" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_1/convolution__15:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="functional_1/conv1d_1/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 1" offset="40" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="functional_1/conv1d_1/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="functional_1/conv1d_1/convolution/ExpandDims_1:0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="functional_1/conv1d_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_1/convolution:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="einsum2070269799440_id_axes__365" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104" size="8" />
			<output>
				<port id="0" precision="I64" names="einsum2070269799440_id_axes__365">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="functional_1/conv1d_1/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_1/convolution/Squeeze:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_3895_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 10" offset="112" size="640" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_3895" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="functional_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/Add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="functional_1/conv1d_3_1/convolution/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_3_1/convolution/ExpandDims:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="functional_1/conv1d_1_2/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 2" offset="752" size="4096" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="functional_1/conv1d_1_2/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="functional_1/conv1d_1_2/convolution/ExpandDims_1:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="functional_1/conv1d_1_2/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_1_2/convolution:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="functional_1/conv1d_1_2/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_1_2/convolution/Squeeze:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="const_fold_opt__215_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1" offset="4848" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="const_fold_opt__215" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="const_fold_opt__215">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="functional_1/conv1d_1_2/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_1_2/BiasAdd:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="functional_1/conv1d_1_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="functional_1/conv1d_1_2/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="functional_1/conv1d_2_1/convolution/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_2_1/convolution/ExpandDims:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="functional_1/conv1d_2_1/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 2" offset="4912" size="4096" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="functional_1/conv1d_2_1/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="functional_1/conv1d_2_1/convolution/ExpandDims_1:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="functional_1/conv1d_2_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_2_1/convolution:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="functional_1/conv1d_2_1/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_2_1/convolution/Squeeze:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="const_fold_opt__204_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1" offset="9008" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="const_fold_opt__204" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="const_fold_opt__204">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="functional_1/conv1d_2_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_2_1/BiasAdd:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="functional_1/add_1_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/add_1_1/Add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="functional_1/activation_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="functional_1/activation_1/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="functional_1/conv1d_3_1/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 5" offset="9072" size="10240" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="functional_1/conv1d_3_1/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="functional_1/conv1d_3_1/convolution/ExpandDims_1:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="functional_1/conv1d_3_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 2" pads_end="0, 2" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_3_1/convolution:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="functional_1/conv1d_3_1/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_3_1/convolution/Squeeze:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="const_fold_opt__213_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1" offset="19312" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="const_fold_opt__213" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="const_fold_opt__213">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="functional_1/conv1d_3_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_3_1/BiasAdd:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="functional_1/conv1d_3_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="functional_1/conv1d_3_1/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="functional_1/conv1d_4_1/convolution/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_4_1/convolution/ExpandDims:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="functional_1/conv1d_4_1/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 5" offset="19376" size="10240" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="functional_1/conv1d_4_1/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="functional_1/conv1d_4_1/convolution/ExpandDims_1:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="functional_1/conv1d_4_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 2" pads_end="0, 2" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_4_1/convolution:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="functional_1/conv1d_4_1/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_4_1/convolution/Squeeze:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="const_fold_opt__201_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1" offset="29616" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="const_fold_opt__201" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="const_fold_opt__201">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="functional_1/conv1d_4_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_4_1/BiasAdd:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="functional_1/add_2_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/add_2_1/Add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="functional_1/activation_1_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="functional_1/activation_1_2/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="functional_1/concatenate_1/concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/concatenate_1/concat:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="functional_1/batch_normalization_1/batchnorm/mul:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1" offset="29680" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="functional_1/batch_normalization_1/batchnorm/mul:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="functional_1/batch_normalization_1/batchnorm/mul:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="functional_1/batch_normalization_1/batchnorm/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/batch_normalization_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="const_fold_opt__200_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1" offset="29808" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="const_fold_opt__200" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="const_fold_opt__200">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="functional_1/batch_normalization_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/batch_normalization_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_103" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="29936" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Transpose__163" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Transpose__163:0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Transpose_3738_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64" offset="29960" size="8192" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Transpose_3738" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="functional_1/multi_head_attention_1/query_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="true" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/multi_head_attention_1/query_1/MatMul:0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="const_fold_opt__198" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="38152" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_fold_opt__198">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="functional_1/multi_head_attention_1/query_1/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/multi_head_attention_1/query_1/Reshape_1:0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_4019_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 2, 32" offset="38184" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_4019" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="functional_1/multi_head_attention_1/query_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/multi_head_attention_1/query_1/Add:0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="einsum2070270392080_ba_right_set__446" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38312" size="8" />
			<output>
				<port id="0" precision="I64" names="einsum2070270392080_ba_right_set__446">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Unsqueeze__451" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Unsqueeze__451:0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_115" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="38320" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Transpose__459" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Transpose__459:0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>10</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Shape__461" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>10</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="Shape__461:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="einsum2070304323088_ba_batch_axes__294" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="38360" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="einsum2070304323088_ba_batch_axes__294">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_138" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38376" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="74" name="Gather__465" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="Gather__240:0,Gather__465:0,Gather__466:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_140" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38376" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="ReduceProd__467" type="ReduceProd" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="ReduceProd__242:0,ReduceProd__467:0,ReduceProd__468:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="einsum2070270392080_ba__1__444" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38384" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="einsum2070270392080_ba__1__444">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="einsum2070270388816_ba_sum_axes__367" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38392" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="einsum2070270388816_ba_sum_axes__367">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_132" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38376" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="80" name="Gather__469" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="Gather__469:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Concat__471" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="Concat__471:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Reshape__473" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>10</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Reshape__473:0">
					<dim>2</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Transpose_3743_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64" offset="38400" size="8192" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Transpose_3743" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="functional_1/multi_head_attention_1/key_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="true" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/multi_head_attention_1/key_1/MatMul:0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="functional_1/multi_head_attention_1/key_1/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/multi_head_attention_1/key_1/Reshape_1:0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_4020_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 2, 32" offset="46592" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_4020" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="functional_1/multi_head_attention_1/key_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/multi_head_attention_1/key_1/Add:0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="einsum2070269888464_id_axes__441" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="46720" size="8" />
			<output>
				<port id="0" precision="I64" names="einsum2070269888464_id_axes__441">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Unsqueeze__455" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Unsqueeze__455:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>10</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_121" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="46728" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Transpose__457" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>10</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Transpose__457:0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Shape__463" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="Shape__463:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_130" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38376" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="96" name="Gather__470" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="Gather__470:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Concat__472" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="Concat__472:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Reshape__475" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Reshape__475:0">
					<dim>2</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="MatMul__481" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MatMul__481:0">
					<dim>2</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_4666" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="46768" size="40" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Reshape__492" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Reshape__492:0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>10</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Squeeze__496" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>10</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Squeeze__496:0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_4021_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="46808" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_4021" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="functional_1/multi_head_attention_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/multi_head_attention_1/Mul:0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="functional_1/multi_head_attention_1/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="functional_1/multi_head_attention_1/Softmax:0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Unsqueeze__227" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Unsqueeze__227:0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>10</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Shape__235" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>10</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="Shape__235:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_207" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38376" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="110" name="Gather__239" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="Gather__239:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_209" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38376" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="ReduceProd__241" type="ReduceProd" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="ReduceProd__241:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_205" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38376" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="114" name="Gather__243" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
